Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotCopyJoinedGeometry Property
 Joined solid geometry cannot be copied as a whole. Instead, select the individual extrusions, etc., using Pick box or Ctrl-select and copy them.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCopyJoinedGeometry { get; }
Public Shared ReadOnly Property CannotCopyJoinedGeometry As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCopyJoinedGeometry {
	FailureDefinitionId^ get ();
}
static member CannotCopyJoinedGeometry : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace